narratives({"other_financial_services": {"company_public_response": null, "timely": "No", "product": "Other financial service", "zip_code": "750XX", "complaint_what_happened": "I was awaiting a check in the mail. I received an email stating that the check had already been cashed. They emailed me a copy of the check with a my signature forged. The person that cashed the check cashed it at ACE Express on XXXX XXXX in XXXX Texas. Prior to her cashing the check at that location she went to another Ace On XXXX XXXX and was not allowed to cash the check because she did not have an identification or drivers license. So to shorten the story she was allowed to cash my check without Id and I am still waiting to receive my money as well as speak with someone with Ace. \n", "sub_product": "Check cashing", "view_id": "yjne-fppi", "date_sent_to_company": "2016-02-03T20:49:30", "consumer_consent_provided": "Consent provided", "date_received": "2016-02-03T20:49:29", "complaint_id": "1772312", "consumer_disputed": "No", "state": "TX", "company_response": "Closed with explanation", "sub_issue": null, "issue": "Fraud or scam", "company": "ACE Cash Express Inc.", "tags": null, "submitted_via": "Web"}, "stats": {"last_updated": "2016-08-29", "percent_timely": 97.0, "response_count": 615893, "complaint_count": 618981, "last_updated_narratives": "2016-08-29"}, "credit_reporting": {"company_public_response": "Company chooses not to provide a public response", "timely": "Yes", "product": "Credit reporting", "zip_code": "197XX", "complaint_what_happened": "XXXX XXXX XXXX filed a judgment against me for an unpaid loan ; however, I was not aware of this because the information was sent to an old address that they had when I entered in the loan agreement. I did not know about the judgment until I pulled a copy of my credit report in XX/XX/XXXX. The first judgment was filed in XXXX XXXX but it was closed. Then they refiled in XXXX XXXX and because I was n't aware of the judgment, I did not appear in court so a default judgment was awarded in XXXX XXXX. The credit bureau originally showed XXXX XXXX on my credit report as the filing date back in XX/XX/XXXX ; however, they have since reported the filing date of XXXX XXXX even though that is not the correct filing date. It is my understanding that a judgment is only permitted to appear on my credit report 7 years from the filing date not the award date. Therefore, this judgment should be removed immediately. I do not have a copy of the original court paperwork because I never received it but I have sent the attached document that was obtained on the court website to all XXXX credit bureaus but XXXX & Experian will not remove the item or update it & the filing date remains XXXX XXXX. They advised me that they verified this information and the information they are reporting is correct. Thank you. \n", "sub_product": null, "view_id": "ur78-i5sn", "date_sent_to_company": "2015-09-22T02:26:52", "consumer_consent_provided": "Consent provided", "date_received": "2015-09-22T02:26:51", "complaint_id": "1573743", "consumer_disputed": "No", "state": "DE", "company_response": "Closed with explanation", "sub_issue": "Problem with statement of dispute", "issue": "Credit reporting company's investigation", "company": "Experian", "tags": null, "submitted_via": "Web"}, "bank_accounts": {"company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response", "timely": "Yes", "product": "Bank account or service", "zip_code": "275XX", "complaint_what_happened": "On XXXX/XXXX/16 a Social Security ACH transaction was received by Wells Fargo Bank and was reflected in my online account as a {$1000.00} deposit and I had a balance in excess of {$1500.00} in my account. I made a withdrawal of {$1100.00} and later in the day attempted use of my debit card for a {$2.00} purchase. The card was denied. Upon returning home, I checked the Wells Fargo web site and saw a balance of {$470.00}. \nToday, XXXX/XXXX/16, I checked the account again and find a negative balance of {$590.00}. \nI call the branch that I had used for the withdrawal and they denied that there had been any such deposit. My next call was to Social Security where the transaction to the proper XXXX and account was verified. I received a phone number to contact the ACH processing at Wells Fargo. After speaking with XXXX persons I find that my account was blocked on XXXX/XXXX/16. No transactions are allowed in or out. \nI called the Loss Prevention phone number that was provided and was told that the Social Security transaction had been returned. I told them that I was to receive a XXXX transaction for {$3100.00} on XXXX/XXXX/16. I was instructed to call back on that date.", "sub_product": "Checking account", "view_id": "ytxv-uppu", "date_sent_to_company": "2016-04-28T20:11:07", "consumer_consent_provided": "Consent provided", "date_received": "2016-04-28T20:11:06", "complaint_id": "1902110", "consumer_disputed": "No", "state": "NC", "company_response": "Closed with monetary relief", "sub_issue": null, "issue": "Deposits and withdrawals", "company": "Wells Fargo & Company", "tags": "Older American, Servicemember", "submitted_via": "Web"}, "up": true, "mortgages": {"company_public_response": "Company believes it acted appropriately as authorized by contract or law", "timely": "Yes", "product": "Mortgage", "zip_code": "125XX", "complaint_what_happened": "It is with great frustration that I write for the XXXX time to you. I have also done everything in my power to complied with SPS Servicing co. This is the XXXX time Sps confirms receipt of my documents and when I call again they are requesting same documents again. My attorney on record submitted a motion and it was just denied. Please hear me out. I want to resolved this problem. I am going through this for the past two and a half years. \nI want to keep my home. I went a head and did a forensic review. Apparently XXXX XXXX bankrupt and my note was in the bankruptcy. Where do I go from here? \nAll I want is for SPS to come on with a loan modification. \n", "sub_product": "Conventional fixed mortgage", "view_id": "gfmg-6ppu", "date_sent_to_company": "2015-05-11T14:40:12", "consumer_consent_provided": "Consent provided", "date_received": "2015-05-11T14:40:12", "complaint_id": "1370427", "consumer_disputed": "No", "state": "NY", "company_response": "Closed with explanation", "sub_issue": null, "issue": "Loan servicing, payments, escrow account", "company": "Select Portfolio Servicing, Inc", "tags": null, "submitted_via": "Web"}, "student_loans": {"company_public_response": null, "product": "Student loan", "consumer_disputed": "No", "tags": null, "sub_product": "Federal student loan servicing", "company": "Navient Solutions, Inc.", "date_sent_to_company": "2016-05-20T15:16:49", "zipcode": "432XX", "date_received": "2016-05-20T15:16:49", "complaint_what_happened": "I have spent years trying to work with XXXX XXXX and now Navient to pay an affordable monthly payment. I can not understand how they can base my required repayment on my gross income amount, without taking my monthly expenses in to account. If I received and my gross monthly income, I wouldn't be in this situation. I'm exhausted with the process of submitting paystubs and paperwork, only to be sent a Repayment Plan in an amount that I simply can not afford. I originally borrowed about {$26000.00}. As of this date, they state that I owe over {$40000.00}!! I've requested forbearances because of their unwillingness to work with me to provide an affordable monthly payment. These forbearances only accrue outrageous interest, which in the end, does nothing at all to help me payoff this loan. In this economy, why should I be paying over 7 % in interest?? This is unfair, nefarious, greed that has ruined my credit and caused many sleepless nights. I feel like they have me just where they want me and as long as they can play this evil game, they can continue to accumulate thousands and thousands of dollars. I truly need your help to stop this abusive behavior because I have no idea how to resolve this matter.", "state": "OH", "timely_response": "Yes", "complaint_id": "1948946", "submitted_via": "Web", "sub_issue": "Can't decrease my monthly payments", "issue": "Can't repay my loan", "company_response_to_consumer": "Closed with explanation", "consumer_consent_provided": "Consent provided"}, "credit_cards": {"company_public_response": "Company chooses not to provide a public response", "timely": "Yes", "product": "Credit card", "zip_code": "119XX", "complaint_what_happened": "Dear Madam/Sir, I had been a Citibank Banking customer since XXXX. I had been a Citicard Mastercard and Visa customer since XXXX. By the end of XXXX, the relationship ended. \n\nMy complaint centers on the fact that Citicard Mastercard XXXX Account # ******************* ) and Visa ( Account # ******************* ) cancelled my cards in XXXX XXXX soon after I had made a paid in full payment of {$24000.00} to Citicard Mastercard and a full payment of {$12000.00} to Citicard Visa. XXXX cards had been in arrears off and on for about one and a half years due to my unemployment status. I made sporadic payments over this time period but in the end I paid all monies due Citicard which included late fees and 15 % interest. \n\nI was never notified that Citicard cancelled both the Mastercard and Visa. I discovered this in XXXX XXXX when I tried to use the XXXX Citicard \" thank you '' points I had earned over time. A Citicard manager ( XXXX XXXX XXXX XXXX XXXX ) informed me that my credit card accounts had been closed by Citicard and since they were closed I forfeited all of my points ( approx. value {$3200.00} XXXX. \n\nI certainly understand Citicards ' right to cancel my credit cards but I take exception to not honoring the Citicard \" Thank You '' points I had earned. \n\nI am enclosing a Citicard statement from XXXX XXXX that shows my points. I can not show a more recent statement as Citicard has locked me out of my online account. \n\nI request that you investigate this matter and hopefully restore my points. I will use the points ' immediately to end my relationship with Citicard. \n\nThank you for your consideration. \n\nBest, XXXX \n", "sub_product": null, "view_id": "wycs-qcs4", "date_sent_to_company": "2015-11-04T22:02:05", "consumer_consent_provided": "Consent provided", "date_received": "2015-11-04T22:02:04", "complaint_id": "1639086", "consumer_disputed": "Yes", "state": "NY", "company_response": "Closed with explanation", "sub_issue": null, "issue": "Rewards", "company": "Citibank", "tags": null, "submitted_via": "Web"}, "debt_collection": {"company_public_response": null, "product": "Debt collection", "consumer_disputed": "No", "tags": null, "sub_product": "Federal student loan", "company": "United Student Aid (USA) Funds", "date_sent_to_company": "2015-08-28T18:40:04", "zipcode": "490XX", "date_received": "2015-08-21T02:09:10", "complaint_what_happened": "This fraudulent debt appeared on my credit file. I am a victim of identity theft. So I notified the company's and they refused to show original contracts so I can better investigate the fraud.", "state": "MI", "timely_response": "Yes", "complaint_id": "1529871", "submitted_via": "Web", "sub_issue": "Debt resulted from identity theft", "issue": "Cont'd attempts collect debt not owed", "company_response_to_consumer": "Closed with explanation", "consumer_consent_provided": "Consent provided"}, "payday_loans": {"company_public_response": "Company believes complaint caused principally by actions of third party outside the control or direction of the company", "timely": "Yes", "product": "Payday loan", "zip_code": "212XX", "complaint_what_happened": "Someone continuously calls my home and family members about a bogus payday loan. They are threatening me with sapena and legal threats. In XX/XX/XXXX or XX/XX/XXXX I did take out a payday loan but I do n't remember the name of the payday loan that I used. The people who called me lead me to believe that they were representing the payday loan that I supposedly used. I asked them to send me documentation stating in writing that I owe them money. They said they would send me an email pertaining to the outstanding payday loan.Due to the scare tactic of them threatening to come to my job and constantly calling my family and me numerous times. I set up a payment arrangement. As I was giving them my information they said they can only take credit cards or debit card prepayments. And so I agreed but once I got off the phone with these scammers I looked up their company name that they gave to me over the phone and the internet revealed that the company is not to be trusted. They are scammers. I have 4 prepayments set up starting on XX/XX/XXXX. I am unable to cancel the payment arrangements and /or prevent them from using my debit card or personal information.", "sub_product": "Payday loan", "view_id": "xiq2-ahjv", "date_sent_to_company": "2016-07-11T22:55:06", "consumer_consent_provided": "Consent provided", "date_received": "2016-06-22T16:16:32", "complaint_id": "1981132", "consumer_disputed": null, "state": "MD", "company_response": "Closed with explanation", "sub_issue": "Can't stop charges to bank account", "issue": "Can't stop charges to bank account", "company": "Bizcorp, LLC", "tags": null, "submitted_via": "Web"}, "prepaid_cards": {"company_public_response": null, "timely": "Yes", "product": "Prepaid card", "zip_code": "231XX", "complaint_what_happened": "I received a {$59.00} rebate card from XXXX on XX/XX/XXXX. It is a prepaid American Express Rewards Card. On the card agreement, it said \" a {$2.00} monthly fee will be accessed against the card balance 5 months after Card Issuance ''. In order to avoid the service fee, I tried to use the card today ( XX/XX/XXXX, a week before XX/XX/XXXX ) for a {$59.00} online transaction and the transaction was declined. After talking to American Express card service, I was told a {$2.00} fee was deducted from the account on XX/XX/XXXX because the card issuance date was XX/XX/XXXX. Also American Express refused to refund the {$2.00} fee. \n\nI feel this is a deceptive practice because American Express Card intentionally do not print the card issuance date on the card or in the letter with the card and then they can charge a fee early than what a consumer thought. The American Express prepaid card customer service refused to refund the customer even they admitted the fee was charged early because the card issuance date was early and they did not inform customers about the issuance date of the card. \n", "sub_product": "Other special purpose card", "view_id": "2t2q-2pud", "date_sent_to_company": "2015-04-07T14:15:23", "consumer_consent_provided": "Consent provided", "date_received": "2015-04-07T14:15:23", "complaint_id": "1318866", "consumer_disputed": "No", "state": "VA", "company_response": "Closed with explanation", "sub_issue": null, "issue": "Fees", "company": "Amex", "tags": null, "submitted_via": "Web"}, "other_consumer_loans": {"company_public_response": null, "timely": "Yes", "product": "Consumer Loan", "zip_code": "232XX", "complaint_what_happened": "i received an e-mail alert telling me that a capitol one auto pulled a hard inquiry and pulled my report and used my social security # without my knowledge and did not speak with me prior to this about this loan, i called capitol one they said they did not pull my report, i then called XXXX they said capitol pulled my repot and my social security # and XXXX told me that some of the information did not match what i have on file, i then called capitol ione back they said they will forward my information, they hourt me in many ways i very upset when talkin with capitol one im ver stressed out at this time i want a law suit filed im getting tired of co. trying to ruin my credit when im trying my best to get it in order and looking good i did not ask or ok to do this i never talked with anyone for this loan \n", "sub_product": "Vehicle loan", "view_id": "uqjt-9neg", "date_sent_to_company": "2015-11-03T18:41:24", "consumer_consent_provided": "Consent provided", "date_received": "2015-11-03T18:41:23", "complaint_id": "1636709", "consumer_disputed": "Yes", "state": "VA", "company_response": "Closed with explanation", "sub_issue": null, "issue": "Shopping for a loan or lease", "company": "Capital One", "tags": null, "submitted_via": "Web"}, "money_transfers": {"company_public_response": null, "product": "Virtual currency", "consumer_disputed": "Yes", "tags": null, "sub_product": "Domestic (US) money transfer", "company": "Coinbase, Inc.", "date_sent_to_company": "2015-10-22T02:23:55", "zipcode": "553XX", "date_received": "2015-10-22T02:23:54", "complaint_what_happened": "Signed up with Coinbase.com with a {$75.00} signup bonus for a {$100.00} deposit into their service. As it took a while to complete their signup, they changed signup bonus to {$10.00}. When asked about bonus, as I signed up for {$75.00} and completed all the steps, they stated that the signup bonus had changed and they no longer offered the higher amount and that requirements were not met, when in fact they were met fully. Never got any signup bonus.", "state": "MN", "timely_response": "Yes", "complaint_id": "1621306", "submitted_via": "Web", "sub_issue": null, "issue": "Fraud or scam", "company_response_to_consumer": "Closed with explanation", "consumer_consent_provided": "Consent provided"}});
